In [99]:
import pandas as pd
import numpy as np

### Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [98]:
import env

In [97]:
def get_db_url(username, hostname, password, database_name):
    url = f'mysql+pymysql://{username}:{password}@{hostname}/{database_name}'
    return url

### Use your function to obtain a connection to the employees database.

In [95]:
url = get_db_url(env.username, env.host, env.password, 'employees')

In [100]:
pd.read_sql('select * from employees limit 5', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

### Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

> "Access denied for user 'blahblahblah' to database 'employes'"

b. Intentionally make an error in your SQL query. What does the error message look like?

> You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'from employees limit 5' at line 1

### Read the employees and titles tables into two separate DataFrames.

In [ ]:
df_employees = pd.read_sql('select * from employees', url)
df_employees

In [69]:
df_titles = pd.read_sql('select * from titles', url)
df_titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

### How many rows and columns do you have in each DataFrame? Is that what you expected?

In [59]:
df_employees.shape
# yes, this is what I expected

(300024, 6)

In [60]:
df_titles.shape
# yes, this is what I expected

(443308, 4)

### Display the summary statistics for each DataFrame.

In [65]:
df_employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [66]:
df_titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

### How many unique titles are in the titles DataFrame?

In [80]:
df_titles.title.nunique()

7

### What is the oldest date in the to_date column?

In [85]:
df_titles.to_date.sort_values().head(1)

16064    1985-03-01
Name: to_date, dtype: object

### What is the most recent date in the to_date column?

In [94]:
df_titles.to_date.sort_values(ascending = False).head(1)

0    9999-01-01
Name: to_date, dtype: object